# Taps
tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask' # install apps via homebrew cask
# tap 'stripe/stripe-cli'

# Binaries
# brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
# brew 'gh'
brew 'git'
# brew 'gnupg'
# brew 'grep'
# brew 'httpie'

# brew 'mackup' # maybe try this?

brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20 //  fix for failure (on the imagick build/install)
# brew 'svn' # Needed to install fonts
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'composer'
# brew 'imagemagick'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'
# brew 'meilisearch'

# Apps
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'insomnia'
cask 'phpstorm'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'malwarebytes'
cask 'lando'
# cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
