# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# Binaries
brew 'bash'      # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mas'       # Mac App Store manager

# Tooling: PHP only to run Composer (even if runtime PHP is in Lando)
brew 'php'
brew 'composer'

# Apps
cask 'docker-desktop
cask 'lando'          # requires password

cask 'firefox'
cask 'google-chrome'
cask 'phpstorm'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'malwarebytes'   # requires password
cask 'zoom'           # requires password

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Kindle',  id: 405399194
